In [18]:
import os as os
os.getcwd()
os.chdir('C:\\Users\\Aneetha\\Desktop\\knowledge-base\\Inceptz_DS\\ML\\source')

In [19]:
import pandas as pd

data = pd.read_csv('Company.csv')

In [43]:
data.head()

   Company   Age  Salary     Place Country
0      TCS  20.0     NaN   Chennai   India
1  Infosys  30.0     NaN    Mumbai   India
2      TCS  35.0  2300.0  Calcutta   India
3  Infosys  40.0  3000.0     Delhi   India
4      TCS  23.0  4000.0    Mumbai   India

In [33]:
data.describe(include ='all')

       Company         Age       Salary   Place Country
count      140  130.000000   124.000000     134     148
unique       3         NaN          NaN      11       1
top        TCS         NaN          NaN  Mumbai   India
freq        55         NaN          NaN      37     148
mean       NaN   30.484615  5312.467742     NaN     NaN
std        NaN   11.096640  2573.764683     NaN     NaN
min        NaN    0.000000  1089.000000     NaN     NaN
25%        NaN   22.000000  3030.000000     NaN     NaN
50%        NaN   32.500000  5000.000000     NaN     NaN
75%        NaN   37.750000  8000.000000     NaN     NaN
max        NaN   54.000000  9876.000000     NaN     NaN

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  140 non-null    object
 1   Age      130 non-null    float64
 2   Salary   124 non-null    float64
 3   Place    134 non-null    object
 4   Country  148 non-null    object
dtypes: float64(2), object(3)
memory usage: 5.9+ KB

In [31]:
data.apply(lambda x: print( x.value_counts() ))

TCS        55
Infosys    47
CTS        38
Name: Company, dtype: int64
22.0    16
33.0    13
44.0    10
21.0     8
23.0     8
34.0     8
32.0     7
35.0     6
0.0      6
41.0     5
45.0     4
43.0     4
24.0     4
36.0     3
40.0     3
20.0     3
25.0     3
31.0     3
46.0     2
50.0     2
37.0     2
26.0     2
30.0     2
18.0     1
19.0     1
38.0     1
51.0     1
17.0     1
54.0     1
Name: Age, dtype: int64
3000.0    9
5000.0    6
5034.0    5
4034.0    5
8202.0    5
1089.0    4
3184.0    4
4824.0    4
9024.0    4
9284.0    4
8345.0    4
7084.0    4
8787.0    4
5835.0    4
2300.0    4
3045.0    4
1234.0    4
2934.0    4
2034.0    4
8943.0    4
9000.0    3
6000.0    3
8000.0    3
3030.0    3
7000.0    3
9876.0    2
3234.0    2
4000.0    2
7654.0    2
5009.0    1
5098.0    1
5435.0    1
5555.0    1
4345.0    1
6544.0    1
3454.0    1
5654.0    1
4324.0    1
3033.0    1
6543.0    1
Name: Salary, dtype: int64
Mumbai        37
Calcutta      33
Chennai       14
Delhi         14
Cochin        13
Hyderabad      8
Noida          8
Podicherry     3
Pune           2
Nagpur         1
Bhopal         1
Name: Place, dtype: int64
India    148
Name: Country, dtype: int64

Company    None
Age        None
Salary     None
Place      None
Country    None
dtype: object

In [27]:
data.apply(lambda x: print( x.unique() ))

['TCS' 'Infosys' 'CTS' nan 'Tata Consultancy Services' 'Congnizant'
 'Infosys Pvt Lmt']
[20. 30. 35. 40. 23. nan 34. 45. 18. 22. 32. 37. 50. 21. 46. 36. 26. 41.
 24. 25. 43. 19. 38. 51. 31. 44. 33. 17.  0. 54.]
[  nan 2300. 3000. 4000. 5000. 6000. 7000. 8000. 9000. 1089. 1234. 3030.
 3045. 3184. 4824. 5835. 7084. 8943. 8345. 9284. 9876. 2034. 7654. 2934.
 4034. 5034. 8202. 9024. 4345. 6544. 6543. 3234. 4324. 5435. 5555. 8787.
 3454. 5654. 5009. 5098. 3033.]
['Chennai' 'Mumbai' 'Calcutta' 'Delhi' 'Podicherry' 'Cochin' nan 'Noida'
 'Hyderabad' 'Bhopal' 'Nagpur' 'Pune']
['India' nan]

Company    None
Age        None
Salary     None
Place      None
Country    None
dtype: object

In [30]:
data["Company"].replace({"Tata Consultancy Services":"TCS"} ,inplace = True)
data["Company"].replace({"Infosys Pvt Lmt":"Infosys"} ,inplace = True)
data["Company"].replace({"Congnizant":"CTS"} ,inplace = True)

In [36]:
data.duplicated().sum # find the duplicated row

<bound method Series.sum of 0      False
1      False
2      False
3      False
4      False
       ...
140    False
141    False
142    False
143    False
148    False
Length: 141, dtype: bool>

In [35]:
data.drop_duplicates(inplace =True) #remove duplicate rows

In [114]:
data.isna().sum()

Company         0
Age             0
Salary          0
Place           0
Country         0
Company_Code    0
Place_Code      0
Country_Code    0
dtype: int64

In [60]:
data[data["Salary"].isna()]

Empty DataFrame
Columns: [Company, Age, Salary, Place, Country]
Index: []

In [69]:
data[data["Place"].isna()]

Empty DataFrame
Columns: [Company, Age, Salary, Place, Country]
Index: []

In [53]:
data.dropna(subset=["Company"], inplace = True)

In [55]:
data["Age"].fillna(data["Age"].mean(),inplace =True)

In [58]:
data["Salary"].fillna(data["Salary"].median(),inplace =True)

In [67]:
data.dropna(subset =["Place"],inplace =True)

In [113]:
data['Company_Code']= data['Company'].astype('category').cat.codes+1
data['Place_Code']= data['Place'].astype('category').cat.codes+1
data['Country_Code']= data['Country'].astype('category').cat.codes+1

In [147]:
data_new= data[["Company_Code","Country_Code","Place_Code","Age","Salary"]]

In [148]:
data_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 119 entries, 0 to 143
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Company_Code  119 non-null    int8
 1   Country_Code  119 non-null    int8
 2   Place_Code    119 non-null    int8
 3   Age           119 non-null    float64
 4   Salary        119 non-null    float64
dtypes: float64(2), int8(3)
memory usage: 8.1 KB

In [121]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [152]:
x = data_new[data_new.columns[~data_new.columns.isin(['Salary'])]]
y=data_new['Salary']

In [153]:
train_x,test_x,train_y,test_y = train_test_split(x,y ,test_size = 0.3 ,random_state =7)

In [154]:
train_x.shape,test_x.shape,train_y.shape,test_y.shape

((83, 4), (36, 4), (83,), (36,))

In [155]:
model = LinearRegression()
model.fit(train_x,train_y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [157]:

print(model.intercept_)
print(model.coef_)

2897.154611800055
[2.74612888e+02 4.26325641e-14 1.21378046e+02 3.13015579e+01]

In [158]:
pred_train = model.predict(train_x) # y=mx+b
pred_test = model.predict(test_x) # y=mx+b

In [159]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score

print("Train - MSE",mean_squared_error(train_y, pred_train))

print("Test - MSE",mean_squared_error(test_y, pred_test))

print("Train - MAE",mean_absolute_error(train_y, pred_train))

print("Test - MAE",mean_absolute_error(test_y, pred_test))

print("Train - R2 Score",r2_score(train_y, pred_train))

print("Test - R2 Score",r2_score(test_y, pred_test))

Train - MSE 4816462.262817581
Test - MSE 6710343.093552943
Train - MAE 1791.7565545579637
Test - MAE 2152.500321925319
Train - R2 Score 0.04235470122053753
Test - R2 Score -0.07010881922651513